{
  "user_id": "2",
  "messages": [
    {
      "content": "Apa itu stunting?",
      "is_user": true,
      "timestamp": "2025-07-27T20:52:57.600996",
      "attachments": []
    },
    {
      "content": "Halo! Saya adalah chatbot stunting yang siap membantu Anda memahami dan mencegah stunting pada anak. Anda bertanya, apa itu stunting?\n\nStunting adalah kondisi gagal tumbuh pada anak balita (di bawah lima tahun) akibat kekurangan gizi kronis dan infeksi berulang, terutama pada 1000 Hari Pertama Kehidupan (HPK) yaitu sejak dalam kandungan hingga usia 2 tahun. Akibatnya, anak menjadi lebih pendek dari standar usianya.\n\n**Bagaimana cara mencegah stunting pada anak?**\n\nAda beberapa cara efektif untuk mencegah stunting, yang berfokus pada pemenuhan nutrisi dan kesehatan anak sejak dini, yaitu:\n\n*   **ASI Eksklusif (Prioritas Tinggi):** Berikan ASI eksklusif selama 6 bulan pertama kehidupan bayi. ASI adalah makanan terbaik untuk bayi karena mengandung nutrisi lengkap dan antibodi yang melindungi bayi dari penyakit.\n\n*   **Nutrisi Ibu Hamil (Prioritas Tinggi):** Pastikan ibu hamil mendapatkan nutrisi yang cukup selama kehamilan. Nutrisi penting yang dibutuhkan antara lain protein, zat besi, asam folat, dan kalsium. Konsultasikan dengan dokter atau ahli gizi untuk mendapatkan rekomendasi nutrisi yang tepat.\n\n*   **MPASI Bergizi (Prioritas Tinggi):** Setelah bayi berusia 6 bulan, berikan Makanan Pendamping ASI (MPASI) yang bergizi dan beragam. Pastikan MPASI mengandung karbohidrat, protein, lemak, vitamin, dan mineral yang dibutuhkan untuk pertumbuhan anak.\n\n*   **Pemantauan Pertumbuhan (Prioritas Sedang):** Pantau pertumbuhan anak secara teratur di posyandu atau fasilitas kesehatan. Dengan pemantauan rutin, kita bisa mendeteksi dini jika ada masalah pertumbuhan dan segera mengambil tindakan yang diperlukan.\n\n*   **Sanitasi dan Kebersihan (Prioritas Sedang):** Jaga kebersihan lingkungan, cuci tangan dengan sabun, dan pastikan akses ke air bersih. Kebersihan yang baik membantu mencegah infeksi dan diare yang dapat menghambat pertumbuhan anak.\n\n*   **Imunisasi Lengkap (Prioritas Sedang):** Berikan imunisasi lengkap sesuai jadwal untuk melindungi anak dari penyakit infeksi. Penyakit infeksi dapat mengganggu penyerapan nutrisi dan menghambat pertumbuhan anak.\n\n**Faktor Risiko Stunting dan Cara Mengatasinya:**\n\nBeberapa faktor risiko stunting antara lain:\n\n*   **Kekurangan gizi pada ibu hamil:** Pastikan ibu hamil mendapatkan nutrisi yang cukup.\n*   **Kurangnya akses ke air bersih dan sanitasi:** Jaga kebersihan lingkungan dan pastikan akses ke air bersih.\n*   **Infeksi berulang pada anak:** Jaga kebersihan dan berikan imunisasi lengkap.\n*   **Praktik pemberian makan yang tidak tepat:** Berikan ASI eksklusif dan MPASI yang bergizi.\n\n**Pentingnya Nutrisi Selama 1000 Hari Pertama Kehidupan:**\n\n1000 Hari Pertama Kehidupan (HPK) adalah periode emas yang sangat penting untuk pertumbuhan dan perkembangan anak. Kekurangan gizi pada periode ini dapat menyebabkan dampak yang tidak dapat diperbaiki, termasuk stunting. Oleh karena itu, penting untuk memastikan ibu hamil dan anak mendapatkan nutrisi yang cukup selama periode ini.\n\n**Rekomendasi Praktis untuk Keluarga:**\n\n*   Konsultasikan dengan dokter atau ahli gizi untuk mendapatkan rekomendasi nutrisi yang tepat.\n*   Berikan makanan yang bergizi dan beragam untuk ibu hamil dan anak.\n*   Jaga kebersihan lingkungan dan pastikan akses ke air bersih.\n*   Pantau pertumbuhan anak secara teratur.\n*   Berikan imunisasi lengkap sesuai jadwal.\n\nSemoga informasi ini bermanfaat! Jika ada pertanyaan lain, jangan ragu untuk bertanya.\n",
      "is_user": false,
      "timestamp": "2025-07-27T20:53:02.745400",
      "attachments": []
    }
  ],
  "context": {
    "last_intent": "pencegahan_stunting",
    "last_entities": {},
    "last_context": []
  }
}